[{"stock_name": "Tesla, Inc. (TSLA)", "address": "1 Tesla RoadAustin, TX 78725United States512 516 8177https://www.tesla.com", "executive_1": "Mr. Elon R. Musk", "executive_2": "Mr. Andrew D. Baglino", "executive_3": "Mr. Vaibhav  Taneja", "executive_4": "Mr. Martin  Viecha", "executive_5": "Brian  Scelfo", "executive_6": "Mr. Jeffrey Brian Straubel", "executive_7": "Mr. Franz  von Holzhausen", "executive_8": "Mr. Xiaotong  Zhu", "executive_9": "Mr. John  Walker", "executive_10": "Mr. Peter  Bannon", "description": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas."}, {"stock_name": "Amazon.com, Inc. (AMZN)", "address": "410 Terry Avenue NorthSeattle, WA 98109-5210United States206 266 1000https://www.aboutamazon.com", "executive_1": "Mr. Jeffrey P. Bezos", "executive_2": "Mr. Andrew R. Jassy", "executive_3": "Mr. Brian T. Olsavsky", "executive_4": "Mr. David A. Zapolsky", "executive_5": "Mr. Douglas J. Herrington", "executive_6": "Mr. Adam N. Selipsky", "executive_7": "Ms. Shelley L. Reynolds", "executive_8": "Dr. Werner  Vogels", "executive_9": "Mr. Dave  Fildes", "executive_10": "Ms. Anuradha  Aggarwal", "description": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington."}, {"stock_name": "Apple Inc. (AAPL)", "address": "One Apple Park WayCupertino, CA 95014United States408 996 1010https://www.apple.com", "executive_1": "Mr. Timothy D. Cook", "executive_2": "Mr. Luca  Maestri", "executive_3": "Mr. Jeffrey E. Williams", "executive_4": "Ms. Katherine L. Adams", "executive_5": "Ms. Deirdre  O'Brien", "executive_6": "Mr. Chris  Kondo", "executive_7": "Mr. James  Wilson", "executive_8": "Suhasini  Chandramouli", "executive_9": "Mr. Greg  Joswiak", "executive_10": "Mr. Adrian  Perica", "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. In addition, the company offers various services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California."}, {"stock_name": "Meta Platforms, Inc. (META)", "address": "1 Meta WayMenlo Park, CA 94025United States650 543 4800https://investor.fb.com", "executive_1": "Mr. Mark Elliot Zuckerberg", "executive_2": "Ms. Susan J. S. Li", "executive_3": "Mr. Javier  Olivan", "executive_4": "Mr. Andrew  Bosworth", "executive_5": "Mr. Christopher K. Cox", "executive_6": "Mr. David M. Wehner", "executive_7": "Mr. Aaron A. Anderson", "executive_8": "Mr. Atish  Banerjea", "executive_9": "Ms. Deborah T. Crawford", "executive_10": "Ms. Jennifer G. Newstead", "description": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California"}, {"stock_name": "Netflix, Inc. (NFLX)", "address": "121 Albright WayLos Gatos, CA 95032United States(408) 540-3700https://www.netflix.com", "executive_1": "Mr. Wilmot Reed Hastings Jr.", "executive_2": "Mr. Theodore A. Sarandos", "executive_3": "Mr. Gregory K. Peters", "executive_4": "Mr. Spencer Adam Neumann", "executive_5": "Mr. David  Hyman", "executive_6": "Ms. Rachel  Whetstone", "executive_7": "Mr. Jeffrey William Karbowski", "executive_8": "Ms. Elizabeth  Stone", "executive_9": "Mr. Spencer  Wang", "executive_10": "Ms. Shweta  Poojari", "description": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California."}, {"stock_name": "Alphabet Inc. (GOOG)", "address": "1600 Amphitheatre ParkwayMountain View, CA 94043United States650 253 0000https://abc.xyz", "executive_1": "Mr. Sundar  Pichai", "executive_2": "Ms. Ruth M. Porat", "executive_3": "Mr. Lawrence Edward Page", "executive_4": "Mr. Sergey  Brin", "executive_5": "Mr. J. Kent Walker", "executive_6": "Dr. Prabhakar  Raghavan", "executive_7": "Mr. Philipp  Schindler", "executive_8": "Ms. Amie Thuener O'Toole", "executive_9": "Ms. Ellen  West", "executive_10": "Ms. Fiona Clare Cicconi", "description": "Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California."}]